### 3. Ordinal Encoding

In [1]:
 import datetime

In [2]:
today_date = datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2023, 9, 4, 10, 15, 11, 732072)

In [8]:
today_date-datetime.timedelta(10)
# here days are decreasing

datetime.datetime(2023, 8, 25, 10, 15, 11, 732072)

In [11]:
### list comprehension
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [12]:
days

[datetime.datetime(2023, 9, 4, 10, 15, 11, 732072),
 datetime.datetime(2023, 9, 3, 10, 15, 11, 732072),
 datetime.datetime(2023, 9, 2, 10, 15, 11, 732072),
 datetime.datetime(2023, 9, 1, 10, 15, 11, 732072),
 datetime.datetime(2023, 8, 31, 10, 15, 11, 732072),
 datetime.datetime(2023, 8, 30, 10, 15, 11, 732072),
 datetime.datetime(2023, 8, 29, 10, 15, 11, 732072),
 datetime.datetime(2023, 8, 28, 10, 15, 11, 732072),
 datetime.datetime(2023, 8, 27, 10, 15, 11, 732072),
 datetime.datetime(2023, 8, 26, 10, 15, 11, 732072),
 datetime.datetime(2023, 8, 25, 10, 15, 11, 732072),
 datetime.datetime(2023, 8, 24, 10, 15, 11, 732072),
 datetime.datetime(2023, 8, 23, 10, 15, 11, 732072),
 datetime.datetime(2023, 8, 22, 10, 15, 11, 732072),
 datetime.datetime(2023, 8, 21, 10, 15, 11, 732072)]

In [13]:
import pandas as pd

In [14]:
data = pd.DataFrame(days)
data.columns=['Day']

In [15]:
data.head()

                         Day
0 2023-09-04 10:15:11.732072
1 2023-09-03 10:15:11.732072
2 2023-09-02 10:15:11.732072
3 2023-09-01 10:15:11.732072
4 2023-08-31 10:15:11.732072

In [16]:
data['Day'].dt.weekday

0     0
1     6
2     5
3     4
4     3
5     2
6     1
7     0
8     6
9     5
10    4
11    3
12    2
13    1
14    0
Name: Day, dtype: int32

In [18]:
data['Day'].dt.minute

0     15
1     15
2     15
3     15
4     15
5     15
6     15
7     15
8     15
9     15
10    15
11    15
12    15
13    15
14    15
Name: Day, dtype: int32

In [19]:
# actually here we need only the below things

In [23]:
data['weekday'] =  data['Day'].dt.day_name()

In [24]:
data.head()

                         Day   weekday
0 2023-09-04 10:15:11.732072    Monday
1 2023-09-03 10:15:11.732072    Sunday
2 2023-09-02 10:15:11.732072  Saturday
3 2023-09-01 10:15:11.732072    Friday
4 2023-08-31 10:15:11.732072  Thursday

In [25]:
dictionary = {
    'Monday' : 1,
    'Tuesday' : 2,
    'Wednesday' : 3,
    'Thursday' : 4,
    'Friday' : 5,
    'Saturday' : 6,
    'Sunday' : 7
}

In [28]:
data['weekday_ordinal']=data['weekday'].map(dictionary)

In [29]:
data

                          Day    weekday  weekday_ordinal
0  2023-09-04 10:15:11.732072     Monday                1
1  2023-09-03 10:15:11.732072     Sunday                7
2  2023-09-02 10:15:11.732072   Saturday                6
3  2023-09-01 10:15:11.732072     Friday                5
4  2023-08-31 10:15:11.732072   Thursday                4
5  2023-08-30 10:15:11.732072  Wednesday                3
6  2023-08-29 10:15:11.732072    Tuesday                2
7  2023-08-28 10:15:11.732072     Monday                1
8  2023-08-27 10:15:11.732072     Sunday                7
9  2023-08-26 10:15:11.732072   Saturday                6
10 2023-08-25 10:15:11.732072     Friday                5
11 2023-08-24 10:15:11.732072   Thursday                4
12 2023-08-23 10:15:11.732072  Wednesday                3
13 2023-08-22 10:15:11.732072    Tuesday                2
14 2023-08-21 10:15:11.732072     Monday                1

### 4. Count or Frequency Encoding

In [30]:
df = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')

In [31]:
df.head()

,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [32]:
df = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', header=None,index_col=False)

In [33]:
df

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [34]:
 df[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [35]:
len(df[1].unique())

9

In [38]:
# these are the columns having categorical features
columns = [1,3,5,6,7,8,9,13]

In [40]:
df=df[columns]

In [41]:
df.columns = ['Employment', 'Degree' , 'Status', 'Designation', 'family_job', 'Race', 'Sex','Country']

In [42]:
df

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba
...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,United-States
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,United-States
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,United-States
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,United-States
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States

In [43]:
for col in df.columns[:]:
    print(col,":", len(df[col].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [44]:
 df['Country'].value_counts()

Country
 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 France                           29
 Greece                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Cambodia                         19
 Trinadad&Tobago                  19
 Laos                             18
 Thailand                         18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Honduras                         13
 Hungary                          13
 Scotland                         12
 Holand-Netherlands                1
Name: count, dtype: int64

In [46]:
 country_map=df['Country'].value_counts().to_dict()

In [47]:
df['Country']=df['Country'].map(country_map)

C:\Users\dell\AppData\Local\Temp\ipykernel_1152\130007054.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Country']=df['Country'].map(country_map)

In [48]:
df

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,29170
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,29170
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,29170
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,29170
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170

#### Advantages
- Easy to use
- Not increasing featurs space

#### Disadvantages
- It will provide same weight if the frequencies are same

### 5.Target guided ordinal encoding
- Ordering the labels according to the target
- Replacing the labels by the joint probability of being 1 or 0

In [49]:
import pandas as pd
df = pd.read_csv('titanic.csv',usecols=['Cabin', 'Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [50]:
df['Cabin'].fillna('Missing', inplace=True)

In [52]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [53]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [54]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [55]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [56]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [57]:
df.groupby(['Cabin'])['Survived'].sum()

Cabin
A      7
B     35
C     35
D     25
E     24
F      8
G      2
M    206
T      0
Name: Survived, dtype: int64

In [58]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [59]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [66]:
ordinal_labels = df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [67]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}

In [68]:
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [69]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

In [70]:
# now we can drop the cabin column since it is changed into integer values
# Based on the output feature, we calculated the mean(frequency) and assigned the rank to each categorical value, this is the target guided encoding

### 6.Mean Encoding

In [73]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [74]:
df['Cabin_mean_ordinal']=df['Cabin'].map(mean_ordinal)

In [75]:
df.head()

   Survived Cabin  Cabin_ordinal_labels  Cabin_mean_ordinal
0         0     M                     1            0.299854
1         1     C                     4            0.593220
2         1     M                     1            0.299854
3         1     C                     4            0.593220
4         0     M                     1            0.299854